src/xml/001-05_1G_UnivRecordRetrieve_Rq.xml

<!--Release 8.0--><!--Version Dated as of 10/Dec/2014 11:53:35--><!--Universal Record Retrieve For Galileo(1G) Request--><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://www.travelport.com/schema/common_v29_0" xmlns:univ="http://www.travelport.com/schema/universal_v29_0">   <soapenv:Body>      <univ:UniversalRecordRetrieveReq AuthorizedBy="user" TargetBranch="TRGT_BRCH" TraceId="trace">         <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>         <univ:UniversalRecordLocatorCode>ZLHJL4</univ:UniversalRecordLocatorCode>      </univ:UniversalRecordRetrieveReq>   </soapenv:Body>
</soapenv:Envelope>
