src/xml/001-03_1G_AirBook_Rq.xml

<!--Release 8.0--><!--Version Dated as of 10/Dec/2014 11:53:33--><!--Air Booking For Galileo(1G) with Minimum data Request--><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">   <soapenv:Header/>   <soapenv:Body>      <univ:AirCreateReservationReq xmlns:univ="http://www.travelport.com/schema/universal_v29_0" AuthorizedBy="user" RetainReservation="Both" TargetBranch="TRGT_BRCH" TraceId="trace">         <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v29_0" OriginApplication="UAPI"/>         <com:BookingTraveler xmlns:com="http://www.travelport.com/schema/common_v29_0" DOB="1969-09-17" Gender="M" Key="gr8AVWGCR064r57Jt0+8bA==" Nationality="US" TravelerType="ADT">            <com:BookingTravelerName First="Jack" Last="Smith" Prefix="Mr"/>            <com:DeliveryInfo>               <com:ShippingAddress>                  <com:AddressName>Home</com:AddressName>                  <com:Street>2914 N. Dakota Avenue</com:Street>                  <com:City>Denver</com:City>                  <com:State>CO</com:State>                  <com:PostalCode>80206</com:PostalCode>                  <com:Country>US</com:Country>               </com:ShippingAddress>            </com:DeliveryInfo>            <com:PhoneNumber AreaCode="303" CountryCode="1" Location="DEN" Number="3333333" Type="Home"/>            <com:Email EmailID="test@travelport.com" Type="Home"/>            <com:SSR Carrier="QF" FreeText="P/IN/F1234567/IN/17Sep69/M/01Jan15/Smith/Jack" SegmentRef="ZTgO7sRlSrCPfqDOfTvnvw==" Status="HK" Type="DOCS"/>            <com:Address>               <com:AddressName>Home</com:AddressName>               <com:Street>2914 N. Dakota Avenue</com:Street>               <com:City>Denver</com:City>               <com:State>CO</com:State>               <com:PostalCode>80206</com:PostalCode>               <com:Country>US</com:Country>            </com:Address>         </com:BookingTraveler>         <air:AirPricingSolution xmlns:air="http://www.travelport.com/schema/air_v29_0" ApproximateBasePrice="GBP179.00" ApproximateTotalPrice="GBP186.20" BasePrice="AUD331.16" EquivalentBasePrice="GBP179.00" Key="zw5igwS5TV+b2nO/DV0G2A==" QuoteDate="2014-11-10" Taxes="GBP7.20" TotalPrice="GBP186.20">            <air:AirSegment ArrivalTime="2014-11-30T07:35:00.000+11:00" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked" AvailabilitySource="S" Carrier="QF" ChangeOfPlane="false" ClassOfService="L" DepartureTime="2014-11-30T06:00:00.000+11:00" Destination="MEL" Distance="456" ETicketability="Yes" Equipment="737" FlightNumber="401" FlightTime="95" Group="0" Key="ZTgO7sRlSrCPfqDOfTvnvw==" LinkAvailability="true" OptionalServicesIndicator="false" Origin="SYD" ParticipantLevel="Secure Sell" PolledAvailabilityOption="O and D cache or polled status used with different local status" ProviderCode="1G" TravelTime="95">               <air:FlightDetails ArrivalTime="2014-11-30T07:35:00.000+11:00" DepartureTime="2014-11-30T06:00:00.000+11:00" Destination="MEL" Distance="456" FlightTime="95" Key="zV1ojUKoRGiUQUFEMgDUQQ==" Origin="SYD" TravelTime="95"/>            </air:AirSegment>            <air:AirPricingInfo ApproximateBasePrice="GBP179.00" ApproximateTotalPrice="GBP186.20" BasePrice="AUD331.16" ETicketability="Yes" EquivalentBasePrice="GBP179.00" IncludesVAT="false" Key="6jeI5IdBSo+cstIHWS36Bw==" LatestTicketingTime="2014-11-30T23:59:00.000+00:00" PlatingCarrier="QF" PricingMethod="Guaranteed" ProviderCode="1G" Taxes="GBP7.20" TotalPrice="GBP186.20">               <air:FareInfo Amount="GBP179.00" DepartureDate="2014-11-30" Destination="MEL" EffectiveDate="2014-11-10T17:09:00.000+00:00" FareBasis="LFLEX" Key="8C8wntyaQaqL3vkOSo5o1w==" Origin="SYD" PassengerTypeCode="ADT">                  <common_v29_0:Endorsement xmlns:common_v29_0="http://www.travelport.com/schema/common_v29_0" Value="SPECIAL FARE CONDITIONS"/>                  <air:FareRuleKey FareInfoRef="8C8wntyaQaqL3vkOSo5o1w==" ProviderCode="1G">6UUVoSldxwgN4+weSa7je8bKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA59iSvR0xBG6O422wYI1U7dkDt6POLdTV+YT+4QEbshGQu0ZscBMSQ5qlMy9qRBQLADC9Xg2PjXRwrVXOWITjrGF/oTXxxF6MeJYtF79PC3YfoLT9JoAKrPwx9zlz405AgU1YGgDx2nJDW+1Zp9Fnx7g2BMJ0qOmdTyy/Q52QOiIg7xhj0/nGDJ7CwmM7MSqMPwBShF29N4Sv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx8Qxibp/OJehpo2LrM59tO1jp8ZENljzx72lVAJ3nO/P7sgsQ0w5ujEy9gVQk2Mz6rcF7TvWtaxDwNMYN8PPF08</air:FareRuleKey>                  <air:Brand BrandFound="false" Key="Ma/Zxsp1TyuVSGDmWLxnGQ==" UpSellBrandFound="false"/>               </air:FareInfo>               <air:BookingInfo BookingCode="L" CabinClass="Economy" FareInfoRef="8C8wntyaQaqL3vkOSo5o1w==" SegmentRef="ZTgO7sRlSrCPfqDOfTvnvw=="/>               <air:TaxInfo Amount="GBP4.20" Category="QR" Key="vWU9aGjDSzGn2/dPNifLtg=="/>               <air:TaxInfo Amount="GBP3.00" Category="WG" Key="uUIaR16rR5CiC60pMhAwQA=="/>               <air:FareCalc>SYD QF MEL 331.16LFLEX AUD331.16END</air:FareCalc>               <air:PassengerType BookingTravelerRef="gr8AVWGCR064r57Jt0+8bA==" Code="ADT"/>               <air:BaggageAllowances>                  <air:BaggageAllowanceInfo Carrier="QF" Destination="MEL" Origin="SYD" TravelerType="ADT">                     <air:URLInfo>                        <air:URL>MYTRIPANDMORE.COM/BAGGAGEDETAILSQF.BAGG</air:URL>                     </air:URLInfo>                     <air:TextInfo>                        <air:Text>1P</air:Text>                        <air:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</air:Text>                     </air:TextInfo>                     <air:BagDetails ApplicableBags="1stChecked">                        <air:BaggageRestriction>                           <air:TextInfo>                              <air:Text>BAGGAGE CHARGES DATA NOT AVAILABLE</air:Text>                           </air:TextInfo>                        </air:BaggageRestriction>                     </air:BagDetails>                     <air:BagDetails ApplicableBags="2ndChecked" ApproximateBasePrice="GBP21.61" ApproximateTotalPrice="GBP21.61" BasePrice="AUD40.00" TotalPrice="AUD40.00">                        <air:BaggageRestriction>                           <air:TextInfo>                              <air:Text>UPTO50LB/23KG AND UPTO55LI/140LCM</air:Text>                           </air:TextInfo>                        </air:BaggageRestriction>                     </air:BagDetails>                  </air:BaggageAllowanceInfo>                  <air:CarryOnAllowanceInfo Carrier="QF" Destination="MEL" Origin="SYD">                     <air:TextInfo>                        <air:Text>BAGGAGE ALLOWANCE DATA NOT AVAILABLE</air:Text>                     </air:TextInfo>                  </air:CarryOnAllowanceInfo>                  <air:EmbargoInfo Carrier="QF" Destination="MEL" Origin="SYD">                     <air:URLInfo>                        <air:URL>MYTRIPANDMORE.COM/BAGGAGEDETAILSQF.BAGG</air:URL>                     </air:URLInfo>                     <air:TextInfo>                        <air:Text>888</air:Text>                     </air:TextInfo>                  </air:EmbargoInfo>               </air:BaggageAllowances>            </air:AirPricingInfo>         </air:AirPricingSolution>         <com:ActionStatus xmlns:com="http://www.travelport.com/schema/common_v29_0" ProviderCode="1G" TicketDate="2014-11-11T10:10:14" Type="TAW"/>         <com:FormOfPayment xmlns:com="http://www.travelport.com/schema/common_v29_0" Key="jwt2mcK1Qp27I2xfpcCtAw==" Type="Credit">            <com:CreditCard CVV="256" ExpDate="2017-05" Key="GAJOYrVu4hGShsrlYIhwmw==" Name="Jack Smith" Number="4123456789001111" Type="VI">               <com:BillingAddress>                  <com:AddressName>Home</com:AddressName>                  <com:Street>2914 N. Dakota Avenue</com:Street>                  <com:City>Denver</com:City>                  <com:State>CO</com:State>                  <com:PostalCode>80206</com:PostalCode>                  <com:Country>US</com:Country>               </com:BillingAddress>            </com:CreditCard>         </com:FormOfPayment>      </univ:AirCreateReservationReq>   </soapenv:Body>
</soapenv:Envelope>
