src/xml/001-06_1G_UnivRecordCancel_Rq.xml

<!--Release 8.0--><!--Version Dated as of 10/Dec/2014 11:53:35--><!--UniversalRecord Cancel For Galileo(1G) with LFS Minimum data Request--><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://www.travelport.com/schema/common_v29_0" xmlns:univ="http://www.travelport.com/schema/universal_v29_0">   <soapenv:Header/>   <soapenv:Body>      <univ:UniversalRecordCancelReq AuthorizedBy="user" TargetBranch="TRGT_BRCH" TraceId="trace" UniversalRecordLocatorCode="ZLHJL4" Version="2">         <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>      </univ:UniversalRecordCancelReq>   </soapenv:Body>
</soapenv:Envelope>
